Autodesk.Revit.DB.IFC.IFCExtrusionCreationData.ClearOpenings
Removes all cached openings from the data.
Since:
2012

Autodesk.Revit.DB.IFC.IFCExtrusionCreationData.AddOpening(Autodesk.Revit.DB.IFC.IFCExtrusionData)
Adds an opening to the data.
Remarks:
The opening is stored for retrieval later via GetOpenings().
data:
The opening.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.IFC.IFCExtrusionCreationData.GetOpenings
Gets a collection of all of the openings stored in this data.
Remarks:
Contains all of the openings stored via AddOpening().
Returns:
The opening information.
Since:
2012

Autodesk.Revit.DB.IFC.IFCExtrusionCreationData.GetLocalPlacement
Gets the reference to the IfcLocalPlacement handle used when creating the extrusion.
Returns:
The IfcLocalPlacement handle.
Since:
2012

Autodesk.Revit.DB.IFC.IFCExtrusionCreationData.SetLocalPlacement(Autodesk.Revit.DB.IFC.IFCAnyHandle)
Sets the data to reference an IfcLocalPlacement handle when creating the extrusion.
Side effect: will set ReuseLocalPlacement to true.
localPlacement:
The IfcLocalPlacement handle.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.IFC.IFCExtrusionCreationData.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.IFC.IFCExtrusionCreationData.AreInnerRegionsOpenings
True if inner regions of the extrusion should become openings, false otherwise.
Since:
2012

Autodesk.Revit.DB.IFC.IFCExtrusionCreationData.ExtrusionDirection
The extrusion direction to generate an extrusion.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.IFC.IFCExtrusionCreationData.CustomAxis
The custom extrusion axis to try when generating an extrusion.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.IFC.IFCExtrusionCreationData.HasExtrusionDirection
Identifies if the data contains a extrusion direction.
Since:
2012

Autodesk.Revit.DB.IFC.IFCExtrusionCreationData.HasCustomAxis
Identifies if the data contains a custom extrusion axis.
Since:
2012

Autodesk.Revit.DB.IFC.IFCExtrusionCreationData.PossibleExtrusionAxes
The axes to try when generating the properties of the extrusion.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2012

Autodesk.Revit.DB.IFC.IFCExtrusionCreationData.ReuseLocalPlacement
Allows re-use of local placement when creating a new local placement
due to shifting of breps when moving towards the origin.
Since:
2013

Autodesk.Revit.DB.IFC.IFCExtrusionCreationData.AllowVerticalOffsetOfBReps
Allows vertical shifting of breps when moving towards the origin.
Since:
2013

Autodesk.Revit.DB.IFC.IFCExtrusionCreationData.ScaledOuterPerimeter
The outer perimeter of the extrusion, scaled to the units of export.
This value represents the perimeter of the outermost curve loop bounding the area of the extrusion.
Zero if the perimeter has never been set on this object.
Since:
2012

Autodesk.Revit.DB.IFC.IFCExtrusionCreationData.ScaledInnerPerimeter
The inner perimeter of the extrusion, scaled to the units of export.
This value represents the perimeter of all of the inner curve loops within the area of the extrusion.
Zero if the perimeter has never been set on this object.
Since:
2012

Autodesk.Revit.DB.IFC.IFCExtrusionCreationData.ScaledWidth
The width of the extrusion, scaled to the units of export.
Zero if the width has never been set on this object.
Since:
2012

Autodesk.Revit.DB.IFC.IFCExtrusionCreationData.Slope
The slope of the extrusion, in degrees.
Zero if the slope has never been set on this object.
Since:
2012

Autodesk.Revit.DB.IFC.IFCExtrusionCreationData.ScaledLength
The length of the extrusion, scaled to the units of export.
Zero if the length has never been set on this object.
Since:
2012

Autodesk.Revit.DB.IFC.IFCExtrusionCreationData.ScaledHeight
The height of the extrusion, scaled to the units of export.
Zero if the height has never been set on this object.
Since:
2012

Autodesk.Revit.DB.IFC.IFCExtrusionCreationData.ScaledArea
The area of the extrusion, scaled to the units of export.
The value will be 0.0 if the area has never been set on this object.
Since:
2012

Autodesk.Revit.DB.IFC.IFCExtrusionCreationData.ForceOffset
True to create new local placement with identity transform.
Since:
2014

Autodesk.Revit.DB.IFC.IFCExtrusionCreationData.#ctor
The default constructor.
Remarks:
All input data will be considered uninitialized.
Since:
2012

Autodesk.Revit.DB.IFC.IFCExtrusionCreationData
A utility object that is used to pass information related to extrusion creation.
Remarks:
This class accepts input used to attempt to create an extrusion (possibly with openings) from Revit geometry.
The output contains information about the created extrusion and its openings. The information set is used to
generate properties for the extruded body and related opening elements in the IFC file.
Since:
2012